Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Romance Punch.tmx
Source language: id
Languages: en

source: YANG LAIN PADA NGAPAIN, YA?
en: what are they doing right now?

source: LIHAT
en: would

source: SUATU HARI KANG BURK BOSAN DIA PUN KE PUNCAK MAIN DI TAMAN SAFARI.
en: I went to the mountain one day to have fun with a singer.

source: MEMANG
en: are tough

source: DI HUTAN!
en: other iron pillars!

source: KITA RELA MATI DEMI FROM!
en: we’re ready to lay down our lives for this prom!

source: NARA BODOH!
en: Nara you fool!

source: YANG PALING
en: is

source: GAK NGERASA
en: don’t feel any

source: BERAKHIR BAIK
en: badly

source: SAYA SUKA!
en: I like it!

source: BERAT LOH ITU…
en: careful, it’s heavy...

source: BAHKAN WALAU STAMINANYA TERKURAS…
en: even when he runs out of stamina...

source: KURSI RODA!!
en: in a wheelchair!

source: BUKAN URUSANKU!!
en: that’s not my business!

source: 27 TETAP JUMLAH
en: twenty seven is still a lot,

source: DI MANA?
en: are they?

source: APA-APAAN DIA,
en: what the-?

source: YA KITA MENCOCOKKAN KEMAMPUAN DAN POSISI MASING-MASING SAAT BERJAGA NANTI.
en: we’ll spread out and work together based on each person’s ability.

source: UDAH TELANJANG!
en: without even realizing it!

source: TERBALIK!
en: sting!

source: INGIN MENDAMAIKAN SEKOLAH?
en: who’s always strived to bring peace to this school?

source: APA-APAAN TUH,
en: what was that?

source: TENTU SAJA!
en: we will!

source: TURUN DI SINI?
en: you’re stopping here?

source: SI RATU!
en: screw you ratu!

source: GAK BUTUH!
en: heck no!

source: SERIUS?
en: Really?

source: INI…
en: now...

source: SAYA PENDUKUNG KERAS KANTIN UTARA, TAPI KALI INI KAMI MENOLAK!
en: I’m a loyal follower of the north canteen gang, but I have to disagree with you this time!

source: BISA MANJAT POHON.
en: you could climb trees!

source: ARKH!
en: ouch!

source: KEBODOHAN
en: madness

source: GAK ADA HAL MENARIK TERJADI…
en: (incorrect segments, translation moved to the missing text sheet)

source: SUSAH
en: It’s

source: SURPRISE APAAN?!
en: what for?!

source: PERHATIKAN SETIAP KEMUNGKINAN!
en: always be aware of your surroundings!

source: PRIA CUNGKRING
en: a skinny geezer

source: LUCU GAK, SIH?
en: isn’t it funny?

source: OH,
en: ah,

source: BOTAK….
en: not bald!

source: BAHKAN
en: even

source: AKU GAK PERNAH
en: it wasn’t me who

source: PAK KARYANI?!
en: mr. karyani?!

source: B*NGS*T,
en: Oi, oi...

source: PILAR BESI
en: from

source: SEMUA AKAN DIURUS
en: take

source: DI TUKPADIA!
en: from an online shop!

source: MENANGANINYA.
en: handle this by themselves.

source: BEGITU DAMAR
en: when Damar

source: TAPI DITEMBAK
en: but he threw

source: TIDAK ADA
en: no one’s

source: TENTU SAJA…
en: (incorrect segments, translation moved to the missing text sheet)

source: SUDAH MENGIKUTI ROPUN
en: for your love and support!

source: JADI PASANG MATA KALIAN BAIK-BAIK!
en: so, keep your eyes open!

source: YAH, SEBENARNYA
en: well, actually

source: COWOK INDIE LU KEMANA?
en: where’s your edgy prince?

source: KITA AKAN LARI
en: we’re getting out of here

source: GAK, SIH?
en: their positions?

source: DAN APAPUN
en: whatever your plan is,

source: HEH SARAH…
en: sarah,

source: KAN GUA BILANG BERKALI-KALI BAKAL ADA PENYERANGAN.
en: I told you, this school was about to get attacked.

source: LAH, BOS LU SENDIRI KEMANA?!
en: huh?! how about your boss? where is he?

source: AH,
en: Wait...

source: DIA SELALU
en: he always goes

source: OH YA,
en: Oh,

source: SAMPAI
en: black propagandas

source: LU DIBUTUHKAN
en: we need you

source: JADILAH
en: you girls,

source: HOEEEK!!
en: bleeh!

source: IH, BANYAK
en: Eek!

source: TEPAT
en: finally

source: AHAHA~ GUA BAKAL KESANA, CUMAN GAK SEKARANG…
en: hahaha... I’ll be there, but not anytime soon...

source: SEPERTI DULU?
en: that I knew?

source: DIAM!
en: shut up!

source: BWOOS
en: Whoosh

source: BERANTEM?!
en: want to fight?!

source: GUA JUGA BISA DENGAR DARI SINI…
en: I can hear it from here...

source: INGAT INI SETIAP KALI LO MACAM-MAMA KE ADIK
en: remember this whenever you’re planning to mess with my sister.

source: TIDAK BANYAK YANG TERJADI SEJAK SAAT ITU, JIKA ADA YANG ANEH PARI PALING PARA PILAR BESI YANG TERLIHAT SERING BERSAMA.
en: not much has happened since then, but, weirdly enough, the iron pillars have been seen together more often lately.

source: AKU GAK BISA
en: I can’t reach

source: YA?!
en: manners, will you?!

source: IYA JUGA,
en: that’s right

source: AMEL.
en: the trigger.

source: HEI,
en: Oi,

source: SOK KEREN
en: with the cool girl

source: UNTUK PERTAMA KALINYA AKU NEGRASA INI SEKOLAH BIASA.
en: for the first time, I feel like this is just a normal high school.

source: TAPI BUKAN UNTUK MENAMBAH KEKUATANNYA, JUSTRU UNTUK MEREDAM TINJUNYA YANG MELEDAK-LEDAK!
en: ...not to hit his enemy, but to hold back his explosive punches!

source: HMM… HARUSNYA AKU JUGA SIH, TAPI KOK AKU NGERASA BOSAN…
en: hmmm... I should be having fun too, but I’m kinda bored...

source: JELASIN, DONG!
en: say something please!

source: KATANYA KITA CUMA MAKAN SIANG?
en: I thought we’d only have some lunch!

source: GAK ADA HARAPAN
en: there’s no way

source: ANDA GAK MENGIKUTI
en: you didn’t follow

source: GAK KEBAGIAN WALKIE TALKIE
en: He has no walkie-talkie.

source: KAU!!
en: you!

source: UDAH JADI
en: Maybe

source: NGEHENTIIN
en: to stop

source: DI TAWURAN ITU
en: with Damar.

source: KALAU BOLEH.
en: I’d like to

source: MAMA GILA?
en: mom, are you serious?!

source: MENYERANG
en: we shouldn’t

source: APINYA.
en: the fire.

source: DI MASA
en: since the beginning of this

source: MENYADARI INI…
en: known...

source: KAU
en: you’re finally

source: GITU-GITU.
en: goodbyes...

source: SAMA PRESIDEN.
en: with the president.

source: MEREKA BERGERAK MENJAUHI SEKOLAH?!
en: are they leaving the school?!

source: GUA YANG
en: I was the guilty

source: SEKALIGUS…
en: once...

source: MULAI DARI SINI
en: we’ll

source: TAPI MALAH
en: Instead, I handed her

source: KURASA ITU CUKUP, THANKS YA!
en: (incorrect segments, translation moved to the missing text sheet)

source: NGAPAIN LU DI SINI?!!
en: what are you doing here?!

source: KAPAN
en: not

source: LU…
en: you...

source: GAK APA-APA
en: she’s okay

source: RA-RATU…
en: r-ratu...

source: KETIGA…
en: three..

source: PAKAI CARA
en: a special treatment

source: CIH.
en: tsk.

source: BAHAYA!
en: danger!

source: SATU TITIK
en: focus our blows

source: JADI INI PETA TENGKORAK BESI, MENCANGKUP SELURUH SEKOLAH, MULAI DARI LAPANGAN MACHO HINGGA HUTAN TERLARANG!
en: this is the map of iron skull high school, all the way down from macho field to the forbidden forest!

source: NGEHIBUR DIA!
en: to comfort her!

source: RAHASIAMU!!
en: secret weapon!

source: HABIS MELIHAT
en: scar on

source: MATA EH MATA!!
en: my eye!

source: BETUL, GUA MEMANG JAGA DI HUTAN KARENA GUA KAYAK TARZAN!
en: You’re right, I’ll be guarding the forest since I look like tarzan!

source: DAN MASIH PUNYA
en: the iron pillars,

source: SETELAH PULANG
en: from

source: TETAP JALAN!
en: they still want to go through with it!

source: MATI
en: You two

source: PELAJARAN…
en: lesson, right?

source: TOKOH UTAMAKU?
en: protagonist hair?

source: KENAPA
en: how

source: KENAPA SIH HARI INI?!
en: what’s up with today?!

source: MENANG TANPA
en: we won’t

source: KEMBALI.
en: by now...

source: SEKARANG, LU TINGGAL MENGHABISI GUA…
en: now, you just need to finish me off...

source: MA--MAKSUDNYA?
en: wh-what do you mean?

source: Syuut
en: sweep

source: YANG BENAR!
en: serious!

source: DHES
en: bam

source: LU MARAH?
en: are you angry?

source: INI PELAJARAN
en: and this is your

source: BARANGNYA
en: what’s all

source: DATANG…
en: coming...

source: Jadi kamu masih mau ke prom?
en: do you still wanna go?

source: YANG MUKUL!
en: doing all the kicking!

source: KENAPA KAMU
en: why are you

source: INI--
en: (redacted)

source: DIKIT LAGI
en: to bash

source: HARUS KITA
en: take matters

source: CUKUP
en: enough

source: PAKE ACARA INGAT-
en: remind him

source: NODA MEMBANDEL…
en: tough to get rid of...

source: SEKOLAH INI BAKAL DISERANG DAN GUA HARUS DI SINI BUAT JAGAIN LU!
en: the school is about to get attacked. I need to defend this spot to keep you safe!

source: NENG KOMPLAIN, YA?
en: huh, are you really complaining?

source: AH, KETAHUAN?!
en: huh, I got caught!

source: BUKAN MINTA MAAF!
en: that’s not an apology!

source: 27 ORANG,
en: twenty seven of us,

source: SELAMAT
en: welcome

source: NYALAHIN LU
en: after she’d seen that

source: 1 APRIL 2020
en: April 1, 2020

source: GUA TAHU
en: I know

source: MENGAMUK!
en: furious!

source: APA LU?!
en: about?!

source: AMAN!
en: safe!

source: SI DIAN DAN TEX LAGI BERANTEM DI LAPANGAN MACHO!
en: dian and tex is fighting at macho field!

source: AKU KEHILANGAN MOMENTUM, DAN SEKARANG PUKULAN SEBENARNYA AKAN DATANG…
en: I’ve lost my momentum, and now the real punch will come!

source: WAAH,
en: Huh?

source: APAKAH AKHIRNYA
en: have you

source: KOK SI
en: how’s

source: LEPASIN
en: get him

source: BEKAS LUKA DI
en: with

source: WALAUPUN
en: even though

source: PERPISAHAN
en: like

source: BAKAR SEKOLAH, BUKAN
en: I just wanted to burn down the school,

source: SAYA AUTHOR DAN SEGENAP TIM
en: We would like

source: MASIH LEBAT
en: some hair,

source: JATI AJA
en: jati

source: BAK
en: crack

source: YANG ANEH-ANEH.
en: people who are “different,”

source: BAHKAN SAMPAI
en: I even bought

source: PUTRA DAN YANG LAIN DI MANA?
en: where are putra and the others?

source: BOLEH ADA
en: can

source: DAN KALIAN
en: and as for

source: MUNCUL
en: she has the audacity

source: RAMBUTNYA BELAH SAMPING SEKARANG!
en: his hair looks different!

source: INGIN MENYAMPAIKAN
en: I was about to pass

source: TAPI SEBELUM ITU KATANYA KEPALA SEKOLAH MAU KASIH SEDIKIT PANTUN.
en: but before we start, the headmaster has prepared a pantun* for us!

source: Tuk
en: tap

source: YA, TERIMA
en: We will...

source: MAAF PAK PRESIDEN,
en: sorry, mr. president,

source: MEL, SOAL PILAR BESI YANG NOLAK PROM…
en: amel, what about those iron pillars who’s been trying to stop the prom?

source: GUA GAK PERCAYA KALIAN!
en: i don’t trust you guys!

source: MENGHUBUNGI
en: call

source: KAMI!
en: to say that!

source: YANG GANGGUIN
en: mess with

source: DAN SEKARANG
en: I

source: GAK BEGINI,
en: be like this.

source: SOAL KEBAKARAN INI
en: have to

source: OKE,
en: okay,

source: APAAN SIH, BANG…
en: what are you talking about?

source: ACARA KELUARGA
en: you were late because of a

source: SERIUS LU?!
en: (incorrect segments, translation moved to the missing text sheet)

source: KUBAWAKAN
en: an

source: AH?
en: Oh?

source: KALAU UGINI DOANG GUA JUGA BISA NYUSUN STRATEGI!
en: we don’t need any strategist to make a crappy plan like this!

source: KASIH SUDAH
en: Thanks for

source: OH…
en: (incorrect segments, translation moved to the missing text sheet)

source: RAT!
en: Ratu.

source: GAN--
en: he’s--

source: BAHAHA,
en: hahaha!

source: SI NIA MINJEM DUIT
en: nia borrowed my money

source: INI AKU MAU PULANG…
en: (incorrect segments, translation moved to the missing text sheet)

source: AKU MAU, KOK!
en: okay, I’m in!

source: ku ku ry yuu
en: cocka-doodle-doo

source: MAU MASUK BARENG GUA?!
en: Want to go in with me?!

source: GUA TETAP AJA
en: but I still

source: EH, ANAK SMA YANG SEREM!
en: what a scary woman!

source: OH GITU,
en: I see...

source: NGUNG
en: whirr

source: SIBUK APAAN?
en: busy doing what?

source: KE LAPANGAN
en: go to

source: REPUTASI
en: iron skull’s

source: PERTOLONGAN.
en: help.

source: GILA!
en: she’s lost her mind!

source: SYUKURLAH
en: thank god

source: SAYA HARUS
en: I’ve got to

source: SUDAH SELESAI BUATKU!
en: it is for me!

source: INI SUDAH DIRENCANAKAN, SEKARANG DIAN BISA MUNCUL KAPAN SAJA!
en: they’ve planned this. dian will show up anytime soon!

source: WHOOS
en: whoosh

source: MINGGIR
en: Get the heck out of the way

source: BALIK?!
en: returned?!

source: ITU SI PUTRA NEMBAK KAMU SAMPAI HEBOH BANGET KEMARIN?
en: what about putra? didn’t he just confess to you a few days ago?

source: BWHOSS
en: whoosh

source: KALIAN SEMUA
en: were already

source: SECARA BERSAMAAN…
en: at the same time...

source: OMONG-OMONG
en: anyway,

source: DUH,
en: Oh, god,

source: EKSTRIM!
en: that’s wack!

source: HEI TUNGGU,
en: Oi,

source: DI DUNIA
en: the real

source: HEH,
en: hey,

source: TERIMA KASIH.
en: thanking you.

source: ITU
en: don’t worry,

source: TERJADI!
en: anymore!

source: WAH…
en: well, well...

source: WAH MENARIK,
en: interesting,

source: BGST!!
en: son of a-!

source: HAH?!
en: huh?!

source: DHESS!
en: pow

source: MENCOBA MENJEBAKKU
en: to frame me

source: DIA TETAP BERCANDA!
en: he still brushes it off as a joke!

source: KOSONG…
en: is so quiet...

source: GAK LAH, KALAU DIA GAK DATANG GUA BAKAL SERET PANTATNYA KE SINI!
en: Of course not! if he’s not coming, I’ll drag him here myself.

source: ANAK NAKAL.
en: bad boys

source: PILAR BESI,
en: the iron pillars,

source: DENGAN OM JARED.
en: mr. jared.

source: HAHAHAHAHA!
en: hahaha!

source: PROM NIGHT PART 4
en: PROM NIGHT PART 1

source: TENTANG LU!
en: about you!

source: AKAN LEBIH
en: This will

source: YA TUHAN…
en: God, give me strength...

source: GUA
en: I won’t

source: oh, kamu gak mau dateng sama aku… Oke…
en: so you won’t come to the prom with me? alright.

source: KITA
en: we

source: MASTIIN SATU HAL…
en: one thing...

source: UNTUK BERHADAPAN
en: training to face

source: TUH!
en: there!

source: KALAU TERNYATA SEBOSAN INI, AKU BERHARAP ADA PENYERANGAN…
en: if I had known that it’d be this boring, maybe the school should’ve been attacked for real!

source: PIKIRAN, HAH?!
en: doing?!

source: JADI,
en: so,

source: BYE!
en: see you!

source: AKU BELUM MENDENGAR
en: still haven’t heard anything

source: KITA HARUS MENGHENTIKAN TAWURAN INI.
en: we have to stop the fighting.

source: TINGGAL
en: Only one cockroach

source: AKU PUNYA SENJATA RAHASIA…
en: I have a secret weapon...

source: MAU PULANG…
en: I wanna go home...

source: AMIT-AMIT,
en: Crap,

source: TIDAK MENJAGA ADIRA
en: keep an eye on her...

source: DAN PASTINYA KITA UDAH SIAPIN SUSUNAN ACARA SERU, DAN PEMILIHAN PROM KING AND QUEEN DI AKHIR ACARA!
en: we’ve come up with a list of fun activities for today! Also, we’ll choose the prom king and queen at the end of the event!

source: BERSAMA
en: with

source: OH NIA, KEBETULAN SEKALI…
en: ah, nia, what a coincidence...

source: OM OM-MU
en: your geezer

source: YANG MENANG…
en: come out victorious!

source: IH, NYESEL NANYA!
en: argh, I shouldn’t have talked to you!

source: DARIPADA TES GAK JELAS
en: Instead of doing that,

source: KITA LAGI DEKOR NIH, BUTUH MEJANYA…
en: we need this table for decoration...

source: AKU MENDENGAR HAMPIR
en: I’d eavesdropped

source: YAUDAH…
en: fine...

source: LAWAN!
en: their oppositions!

source: LALU!
en: past, huh?!

source: GUA YANG NANYA
en: let me ask you this,

source: DENGAN SEDIKIT RESEARCH BERMODALKAN INSTANGERAM AKU BERHASIL MENDAPATKAN FOTO INI DARI SATU AKUN MISTERIUS DAN DIAN DI-TAG SEBAGAI FOTOGRAFERNYA.
en: With a bit of instageram research, I was able to acquire this photo from a mysterious account with dian tagged as the photographer.

source: LAGI
en: We’ve

source: PERTAMA!
en: generation!

source: MENGECEWAKAN!!
en: such a disappointment!!!

source: APA YANG BAKAL
en: care

source: IYA BENAR JUGA, MEL, KITA HARUS MILIH PROM KING AND QUEEN!
en: ah, right, we must elect the prom king and queen!

source: MENDADAK.
en: of something first...

source: LARILAH DARI SINI,
en: run!

source: CARA MEREKA
en: to

source: CERITANYA UDAHKAN?
en: are you done already?

source: LAKUIN INI KE KAMU?
en: to you?

source: MENANG UNDIAN LIBURAN,
en: vacation there,

source: DAN AKU MAU PULANG!
en: (incorrect segments, translation moved to the missing text sheet)

source: LANGSUNG PULANG!
en: not after everything he’s done!

source: AKU JATUH CINTA
en: that I’m in love

source: UDAH TAHU BAKAL ADA SERANGAN!
en: you know we’ll be attacked!

source: YA, KUPIKIR AKU TURUN
en: I thought I’d gotten off

source: KAYAKNYA NYUNGSEP…
en: (incorrect segments, translation moved to the missing text sheet)

source: TAPI KENAPA MEREKA BERKELIARAN BEBAS?
en: but how could they do this?

source: BANGSAT, GUA CUMA MAU
en: you bastard.

source: DAN YANG LAIN
en: and the others

source: MENANG!
en: it!

source: SEOLAH-OLAH INI ADALAH
en: blame it all

source: JUMLAH SEGITU
en: that amount of girls

source: HOI!
en: hey!

source: HUU HUUU!
en: Huuu huuu!

source: APA YANG LU
en: what are you

source: HAH, JANGAN
en: Oi, don’t tell

source: MUNCUL…
en: showed up...

source: TAPI MASIH BERANI
en: but you didn’t seem unhinged

source: SEKARANG KITA
en: I think we’d better

source: MAKIN SUSAH
en: since

source: WHUUS
en: whoosh

source: AKU MENYESAL
en: kind of

source: SEKARANG KAN…
en: about your condition--

source: INI YANG GUA TAKUTIN, KAMU GAK BISA JAGA DIRI!
en: this is what I’ve been afraid of. you just couldn’t get a hold of yourself, huh?!

source: JURUS
en: Prawn

source: I-IYA…
en: Am I really-?

source: NAMBAH, NIH.
en: has turned, huh?

source: BANTUANNYA.
en: the help.

source: DICIUM LAGI!
en: you to kiss me again!

source: DIAN SI TINJU GRANAT!
en: dian the grenade punch!

source: SRT
en: Whoosh

source: BERHENTI
en: stop

source: LAWANNYA!
en: you got here!

source: SIP,
en: you’re

source: YAUDAH,
en: Okay, then...

source: BAHKAN LU NGEBANTU
en: you even helped me

source: PERGI SEKARANG
en: you’d better

source: JAWABAN BENER,
en: a proper answer

source: BESOKNYA AKU
en: back

source: HEEH?
en: eh?

source: KEBAKARANNYA
en: wouldn’t

source: KABUR.
en: escaped.

source: BERDIRI?!
en: his feet!

source: SIAL, BANYAK NYAMUK DI SINI.
en: Shoot, there’s a lot of mosquitos here.

source: SEBAGAI ORANG
en: He was the second strongest

source: EH, SEBENARNYE GUA DI BANDARA.
en: well, actually, I’m at the airport right now.

source: TAPI TIDAK
en: but it wouldn’t work

source: GUA BARU AJA
en: I’m almost

source: COWO-COWO,
en: huh,

source: HANYA UNTUK
en: just for a bunch

source: SELAIN BARANGNYA
en: a place filled with

source: SI BONI GAK BISA NGOMONG, LO KESINI KAN!
en: boni is unable to talk, but you’re coming, right?!

source: SAAT TERPURUK
en: the low point

source: KALIAN BERDUA
en: you two go on

source: NAMUN JADI CANGGUNG
en: but I felt really awkward

source: MAAF…
en: sorry...

source: SIAL.
en: crap!

source: GUA RASA
en: I guess we

source: SEKARANG…
en: now...

source: SEMUA
en: It’s

source: DITANYA LAGI
en: without

source: CEWEK
en: she’ll--

source: SAMA SEPERTI
en: just what you did

source: MASIH PADA JAGA
en: are they still guarding

source: MUKUL ANDA!
en: bash your head in, of course!

source: GARA-GARA BUKU ITIK NARA…
en: because of Nara’s book...

source: BANTU-BANTU APA GITU, PALING NGGAK KAMU NYARI PASANGAN PROM, GIH!
en: you should help out! or maybe find someone to be your prom date.

source: INTENS!!
en: so intense!

source: WTF?
en: Huh?!

source: AARGHH!!
en: aarghhh!

source: MUNGKIN KAU DIKIRIMKAN FOTO DARI SESEORANG?
en: someone sent you a photograph, right?

source: SAAT ITU AKU HENDAK
en: I was

source: SAAT AKU
en: to me when

source: MEREKA BISA
en: they could

source: BODO AH!
en: whatever!

source: CEWEK GILA!
en: (incorrect segments, translation moved to the missing text sheet)

source: KAMU YANG MABUK!
en: you are!

source: SEKALIGUS!
en: with one strike!

source: TERBAKAR.
en: feel so good.

source: WHOO
en: swoosh

source: SENDIRI.
en: eventually.

source: PINTU KELUAR
en: we’ve sealed

source: LIBURAN, KOK!
en: on a vacation!

source: BRAK!
en: blam

source: LU KOK
en: why

source: APA
en: Maybe I

source: NENTUIN PILIHAN LU…
en: decision...

source: GAK SEGAN MENGHABISI
en: he would finish her off

source: KAMU TIDAK ADA DI LIST
en: but you’re not

source: LU HARUS JAGA DIA ATAU GUA BUNUH LU!
en: You bet your ass you will or I’ll kill you!

source: LU GUA
en: I’ll let you

source: MBAK MASIH
en: she still

source: LU SELALU
en: you’ve always

source: LUKISAN GUA.
en: my paintings.

source: GAK PERLU
en: have to lie,

source: MELAKUKANNYA
en: it to be honest...

source: SIAPA KAMU?
en: who are you?

source: ALASAN DIAN BERADA DI LEVEL BAWAH PILAR BESI KARENA DIA TIDAK PERNAH SERIUS!
en: the reason dian’s ranked the last among the pillars is because he never takes anything seriously!

source: DARI MANA?
en: Where does it come from?

source: BUKANNYA LU
en: shouldn’t

source: RATU, APA
en: ratu, have you

source: LAGI…!
en: case...

source: WAA
en: rumble

source: DAN KENAPA
en: And why

source: BETON INI…
en: muscles...

source: BELUM DIBALIKIN
en: and she hasn’t paid it back.

source: SAYA SERING DITINGGAL PELANGGAN GAK PERNAH KOMPLAIN, TUH!
en: when a customer cancels my order, I never complain.

source: TENAGAKU
en: I’m almost at

source: NAKSIR?
en: like what you’re seeing?

source: TERIMA KASIH ATAS KERJA SAMA KALIAN DAN JUGA BUAT KEPALA SEKOLAH YANG NGASIH IJIN…
en: thank you for your cooperation and thank you to the headmaster for giving us the permission to hold this event...

source: LUMPUH.
en: now.

source: LANGSUNG
en: Let’s just get on

source: SIALAN,
en: fools!

source: KAMU ADA DI
en: are

source: GU-GUA LIHAT DI KELAS 2B, KELAS PALING POJOK…
en: (incorrect segments, translation moved to the missing text sheet)

source: PURA-PURA BODOH
en: foolery,

source: IYE, IYE,
en: okay, okay...

source: HAL YANG SEPELE?!
en: a good thing for her, you punk?!

source: CEWEK ITU!!
en: her!!!

source: DIA BAHKAN BELUM MELANCARKAN PUKUALNNYA,
en: he hasn’t even moved his hand,

source: SELAIN GUDANG,
en: except for the warehouse,

source: PUKULAN ANAK ANDA!
en: kick your butt!

source: DENGAN CERITA
en: would always

source: BINTANG GAK TAHU, DEH.
en: i don’t know about bintang, though.

source: MAKASIH, TANTE!
en: thanks auntie!

source: APINYA!
en: up!

source: SEPERTI INI?!
en: end up like this?!

source: ITU BUKAN
en: that’s not

source: TURUN ENTAH DI MANA…
en: gotten off here...

source: BANTU GUA,
en: to help me

source: BERISIK!
en: shut up!

source: AKU LAGI SIBUK BANGET, NIH!
en: I’m super busy right now!

source: PADAMU.
en: in you.

source: DARI RUMAH DIAN.
en: dian’s house.

source: KALAU BENER ADA SERANGAN GIMANA?
en: what if the school is really about to get attacked?

source: TEMENIN JEMPUT
en: would you go with me

source: LAGI GENTING GINI
en: we’re in a serious situation,

source: PUKULAN INI!
en: take this blow!

source: 2 TAHUN LALU.
en: two years ago.

source: BAHASA
en: Huh? what’s

source: BAROTO (49) PRESIDEN INDONESIA TERKUAT DALAM SEJARAH!
en: baroto (49) the strongest president of Indonesia of all time!

source: KAMPANYE INI
en: campaign season,

source: IYA…
en: yup...

source: MA-MAAF DEH!
en: S-sorry...

source: MAU APA DIA?!
en: what does he want?!

source: BOHONG, KAN…
en: you know...

source: DIA KAPAN
en: did

source: BEREDAR!
en: fake news!

source: KAMU GAK PERLU
en: you don’t have

source: KELUAR
en: to get out

source: SIAL
en: crap!

source: DAMAR KE SINI
en: me

source: DI HOTEL!!
en: from the hotel!

source: GAK BAKAL GUA MAAFKAN!
en: I won’t forgive you!

source: HMM… SEPERTINYA SEMUA BERJALAN LANCAR…
en: (incorrect segments, translation moved to the missing text sheet)

source: ADIK GUA, ADIRA…
en: because my sister, adira...

source: BANGET, NIH!
en: not that simple, you know?!

source: AKAN LEBIH PERCAYA SIAPA?
en: believe, the iron pillars

source: SURPRISE?
en: a surprise?

source: MENURUTMU, ORANG-ORANG
en: whom will people

source: INGUSAN SEPERTI LU
en: bimbo like you

source: ANGLE MANAPUN
en: how you look at it,

source: ADA DI SEKOLAH.
en: you know?!

source: AH!!
en: oh!

source: KERJA
en: good

source: KAMU PULANG SEKARANG!
en: you, go home now!

source: KAK DIAN, AKU BISA JELASIN APA YANG TERJADI!
en: dian, I can explain everything!!!
